Revit.Elements.Views.ScheduleView.#ctor(Revit.Elements.Category,System.String,Revit.Elements.Views.ScheduleView.ScheduleType)
Private constructor for creating Schedules from Category/ScheduleType.

Revit.Elements.Views.ScheduleView.#ctor(Revit.Elements.Element,System.String)
Private constructor for creating Schedules from AreaScheme.

Revit.Elements.Views.ScheduleView.InitScheduleView(Revit.Elements.Category,System.String,Revit.Elements.Views.ScheduleView.ScheduleType)
Initialize a ScheduleView Element by Category, name and ScheduleType.
category: Category of elements that Schedule will display.
name: Name of the Schedule.
type: ScheduleType ex: Key Schedule.

Revit.Elements.Views.ScheduleView.InitScheduleView(Revit.Elements.Element,System.String)
Initialize a ScheduleView Element by AreaScheme and name.
areaScheme: Area Scheme.
name: Name of the Schedule.

Revit.Elements.Views.ScheduleView.CreateAreaSchedule(Revit.Elements.Element,System.String)
Create Area Schedule by Area Scheme and Name.
areaScheme: Area Scheme that Schedule will be associated with.
name: Name of the Schedule View.
Schedule View.

Revit.Elements.Views.ScheduleView.Export(System.String,Revit.Schedules.ScheduleExportOptions)
Export View Schedule to CSV, TSV etc.
path: A valid file path with file extension.
exportOptions: Export Options.
Schedule View.